# GetDuctSizeSettingIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeSettings..::..GetDuctSizeSettingIterator Method
DuctSizeSettings Class See Also
---
Returns a DuctSizeSettingIterator object that iterates through the collection.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DuctSizeSettingIterator GetDuctSizeSettingIterator()
```

Visual Basic
---
```text
Public Function GetDuctSizeSettingIterator As DuctSizeSettingIterator
```

Visual C++
---
```text
public:
DuctSizeSettingIterator^ GetDuctSizeSettingIterator()
```

# ### Return Value
A DuctSizeSettingIterator object that can be used to iterate through key-value pairs in the collection.
# See Also
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace